; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=101, out_folder=htg/blocksworld/training, instance_id=81, seed=2105, goal_proportion=0.1

(define (problem blocksworld-81)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 - object)
 (:init 
    (arm-empty)
    (clear b61)
    (on b61 b25)
    (on-table b25)
    (clear b92)
    (on b92 b94)
    (on b94 b45)
    (on-table b45)
    (clear b13)
    (on-table b13)
    (clear b4)
    (on b4 b34)
    (on b34 b64)
    (on b64 b88)
    (on b88 b70)
    (on-table b70)
    (clear b98)
    (on b98 b33)
    (on b33 b49)
    (on b49 b26)
    (on b26 b17)
    (on b17 b24)
    (on-table b24)
    (clear b95)
    (on b95 b11)
    (on b11 b39)
    (on-table b39)
    (clear b97)
    (on b97 b82)
    (on b82 b68)
    (on b68 b37)
    (on b37 b76)
    (on-table b76)
    (clear b20)
    (on b20 b54)
    (on-table b54)
    (clear b96)
    (on b96 b14)
    (on b14 b27)
    (on b27 b81)
    (on-table b81)
    (clear b72)
    (on-table b72)
    (clear b66)
    (on-table b66)
    (clear b101)
    (on b101 b36)
    (on b36 b71)
    (on-table b71)
    (clear b69)
    (on b69 b51)
    (on-table b51)
    (clear b31)
    (on b31 b41)
    (on b41 b42)
    (on b42 b32)
    (on b32 b86)
    (on-table b86)
    (clear b43)
    (on-table b43)
    (clear b84)
    (on b84 b100)
    (on b100 b58)
    (on b58 b67)
    (on b67 b60)
    (on b60 b53)
    (on b53 b87)
    (on b87 b16)
    (on-table b16)
    (clear b48)
    (on b48 b59)
    (on-table b59)
    (clear b23)
    (on b23 b44)
    (on-table b44)
    (clear b80)
    (on b80 b21)
    (on b21 b30)
    (on b30 b22)
    (on b22 b89)
    (on b89 b28)
    (on b28 b52)
    (on b52 b38)
    (on b38 b18)
    (on b18 b83)
    (on-table b83)
    (clear b1)
    (on b1 b40)
    (on b40 b93)
    (on b93 b46)
    (on-table b46)
    (clear b62)
    (on b62 b6)
    (on b6 b74)
    (on b74 b3)
    (on b3 b91)
    (on b91 b99)
    (on-table b99)
    (clear b79)
    (on b79 b29)
    (on b29 b7)
    (on b7 b15)
    (on b15 b77)
    (on b77 b73)
    (on b73 b47)
    (on b47 b65)
    (on b65 b50)
    (on-table b50)
    (clear b35)
    (on b35 b2)
    (on b2 b12)
    (on-table b12)
    (clear b75)
    (on b75 b5)
    (on b5 b63)
    (on-table b63)
    (clear b9)
    (on-table b9)
    (clear b10)
    (on b10 b57)
    (on b57 b85)
    (on-table b85)
    (clear b56)
    (on-table b56)
    (clear b8)
    (on b8 b90)
    (on b90 b55)
    (on b55 b78)
    (on b78 b19)
    (on-table b19))
 (:goal  (and 
    (clear b10)
    (on-table b10)
    (clear b7)
    (on b7 b3)
    (on b3 b2)
    (on b2 b6)
    (on b6 b9)
    (on-table b9)
    (clear b5)
    (on b5 b4)
    (on b4 b1)
    (on b1 b8)
    (on-table b8))))

; plan
1. (unstack b8 b90)
   deleted: (on b8 b90) (clear b8) (arm-empty)
   added: (holding b8) (clear b90)
   goals met: 2 of 13
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 13
3. (unstack b75 b5)
   deleted: (on b75 b5) (clear b75) (arm-empty)
   added: (holding b75) (clear b5)
   goals met: 4 of 13
4. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 13
5. (unstack b4 b34)
   deleted: (on b4 b34) (clear b4) (arm-empty)
   added: (holding b4) (clear b34)
   goals met: 4 of 13
6. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 5 of 13
7. (unstack b10 b57)
   deleted: (on b10 b57) (clear b10) (arm-empty)
   added: (holding b10) (clear b57)
   goals met: 4 of 13
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 6 of 13
9. (unstack b5 b63)
   deleted: (on b5 b63) (clear b5) (arm-empty)
   added: (holding b5) (clear b63)
   goals met: 5 of 13
10. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 13
11. (unstack b79 b29)
   deleted: (on b79 b29) (clear b79) (arm-empty)
   added: (holding b79) (clear b29)
   goals met: 7 of 13
12. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 7 of 13
13. (unstack b29 b7)
   deleted: (on b29 b7) (clear b29) (arm-empty)
   added: (holding b29) (clear b7)
   goals met: 8 of 13
14. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 8 of 13
15. (unstack b62 b6)
   deleted: (on b62 b6) (clear b62) (arm-empty)
   added: (holding b62) (clear b6)
   goals met: 8 of 13
16. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 8 of 13
17. (unstack b6 b74)
   deleted: (on b6 b74) (clear b6) (arm-empty)
   added: (holding b6) (clear b74)
   goals met: 8 of 13
18. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 9 of 13
19. (unstack b74 b3)
   deleted: (on b74 b3) (clear b74) (arm-empty)
   added: (holding b74) (clear b3)
   goals met: 9 of 13
20. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 9 of 13
21. (unstack b7 b15)
   deleted: (on b7 b15) (clear b7) (arm-empty)
   added: (holding b7) (clear b15)
   goals met: 8 of 13
22. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 10 of 13
23. (unstack b35 b2)
   deleted: (on b35 b2) (clear b35) (arm-empty)
   added: (holding b35) (clear b2)
   goals met: 10 of 13
24. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 10 of 13
25. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 10 of 13
26. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 11 of 13
27. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 9 of 13
28. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 10 of 13
29. (unstack b3 b91)
   deleted: (on b3 b91) (clear b3) (arm-empty)
   added: (holding b3) (clear b91)
   goals met: 10 of 13
30. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 11 of 13
31. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 13
32. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 12 of 13
33. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 10 of 13
34. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 11 of 13
35. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 10 of 13
36. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 13
37. (unstack b1 b40)
   deleted: (on b1 b40) (clear b1) (arm-empty)
   added: (holding b1) (clear b40)
   goals met: 10 of 13
38. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 11 of 13
39. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 11 of 13
40. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 12 of 13
41. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 13
42. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 13 of 13
